[
    {
        "teamName": "Andrea Liao",
        "teamNum": 1,
        "description": "Genealogy app for students learning history!",
        "categories": [
            "Education",
            "Games"
        ],
        "teamMembers": "Andrea Liao",
        "sectionNum": 5
    },
    {
        "teamName": "August",
        "teamNum": 1,
        "description": "AUGUST is a new mystery game that uses LLM-backed dialogue trees to create a more immersive gameplay experience. During the early hours of December 9th, 2023, a 28-year-old ace detective is mysteriously found dead in a park. The police chief is saying it’s suicide… but is the case really so simple? You’re the investigator now—talk freely with townspeople (with an innovative new system that blends LLM technology and handcrafted dialogue), uncover clues, and answer the question: what really happened to August Laurier?\n\nAll writing, artwork, animation, and programming were done by myself! ",
        "categories": [
            "Games"
        ],
        "teamMembers": "Michelle Fu",
        "sectionNum": 0
    },
    {
        "teamName": "Lines and Letters",
        "teamNum": 2,
        "description": "Lines and Letters is an opportunity to take your word creation skills to the next level! The Lines and Letters web application is a word game that can be played against friends or against the computer. The game has two phases. In the first phase, players compete to capture letters on a board. On a single turn, a player can draw a line on the board, and if that player’s line completes a box around a letter, they have captured that letter! The first phase ends after all letters on the board are claimed. In the second phase, each player must create different words with the letters that they have captured. Longer words score more points! At the end of the game, the player with the most points wins! Invite a few friends, and play today!",
        "categories": [
            "Games"
        ],
        "teamMembers": "Peyton Lee, Serena Kravantka, Osose Ewaleifoh, Brandon Ring, Sajel Galhotra",
        "sectionNum": 7
    },
    {
        "teamName": "Stellar Surveillance",
        "teamNum": 3,
        "description": "Embark on a thrilling intergalactic adventure as an alien explorer on a mission to gather data on diverse species across various galaxies. Your journey is fraught with danger, as hostile enemies constantly threaten your ship. Defend yourself with the help of loyal creatures, fighting off attackers to secure precious materials. Use these resources to buy enhanced defenses, recruit additional creatures, and unlock powerful upgrades.\n\nYour ship features a state-of-the-art generator powering an advanced incubator. Hatch new creatures from collected eggs or experiment by combining eggs to create unique hybrids with enhanced abilities. These new allies are crucial in your battle to protect your ship and complete your research.\n\nStrategically manage resources, evolve your defenses, and harness the power of your creatures to become the ultimate alien explorer. The success of your mission—and the fate of your galaxy—rests in your hands!",
        "categories": [
            "Games"
        ],
        "teamMembers": "Michael Granado, Shruti Sridhar, Oluseyi Ogundipe, Peter De La Cruz",
        "sectionNum": 7
    },
    {
        "teamName": "Quad Contest",
        "teamNum": 4,
        "description": "For CS 194W, our team created “Quad Contest,” a top-down 2D roguelike that centers on a Stanford student trying to survive an onslaught of Berkeley Bears in Main Quad. It is a wave based game, with the difficulty of the game increasing with more bears that get quicker. The player can defend by throwing eggs at the bears and dodging to evade. Once the player is finally caught by a bear, their final score is calculated based on how long the player survived. This project has been a great learning experience in game design, Unity, and C#, and our main goal for the past project was to get a proof-of-concept and test out some mechanics to see what we would’ve liked to continue with.",
        "categories": [
            "Games"
        ],
        "teamMembers": "Calvin Laughlin, Peter Ling, Abe Yosef, Whayden Dhamcho",
        "sectionNum": 7
    },
    {
        "teamName": "Sternfahrt",
        "teamNum": 5,
        "description": "DriveAhead is a meeting assistant designed specifically for Mercedes drivers who have multiple meetings with new people during the day. While driving to work, the user can interact with the voice-enabled assistant to prepare for their upcoming meetings. The assistant links to the user's calendar to get a list of meetings and attendees, scraping LinkedIn data for those attendees. DriveAhead also has access to Wikipedia and can actively search LinkedIn for more people if prompted by the user.\nThe driver can ask questions about meeting topics, attendee backgrounds, and potential connections they may have based on their own LinkedIn profile data (e.g. same university). After the meeting prep, DriveAhead emails a summary to the user for future reference.\nThe DriveAhead product is hosted on Streamlit, where the user can type queries and receive text responses, or use voice input/output. The core value proposition is providing meeting intelligence and prep while taking advantage of drive time.",
        "categories": [
            "Automotive",
            "Business/Office",
            "Productivity"
        ],
        "teamMembers": "Daniel Lee, Yubin Jee, Jian Xu, Ellie Yang",
        "sectionNum": 0
    },
    {
        "teamName": "KERWY",
        "teamNum": 6,
        "description": "The Mercedes-Benz AI Palette is a set of entertainment-focused conversational AI personas that a driver can interact with. We crafted three personas — Football Commentator, Old Sport, and Art & Nature — to mimic the speech and personality of Peter Drury, Frank Sinatra, and David Attenborough. Powered by GenAI, these personas engage in dialogue, react to events like honks and acceleration, and offer persona-specific interactions.\n\nBuilt on the Android platform with conversational LLMs and text-to-speech synthesis, our models capture the distinct style, voice, and tone of each real-world figure, ensuring authentic conversations that make them sound like real friends. The personas also react to honks and acceleration detected by sensors on a physical minicar. Additionally, each persona offers unique features: Football Commentator gives football news updates, Old Sport introduces new songs, and Art & Nature uses computer vision to respond to the driver's gestures and narrate surroundings.",
        "categories": [
            "Automotive"
        ],
        "teamMembers": "Katherine Chen, Esteban Wu, Ryan Kang, Will Fang, Yannie Tan",
        "sectionNum": 0
    },
    {
        "teamName": "Mercedes Kart",
        "teamNum": 7,
        "description": "MercedesKart is launching Waymate, a LLM/Vision-model-powered parking sign interpreter and road sign translator. It offers real time road sign translation from eight languages to the user’s preferred language. Sign translations and interpretations will be displayed on the heads-up display so the driver can keep their eyes on the road; for our prototype, we have implemented our system in an iPad app. Additionally, the app features automatic detection and interpretation of parking signs, informing users whether and for how long they can park based on the current time.\n\nWaymate targets those driving in a place where they can’t read the native language. Although Google Maps can provide navigation instructions, being able to recognize physical signs adds another layer of confidence. Waymate also takes the guesswork out of interpreting parking signs, which can be costly and frustrating.",
        "categories": [
            "Automotive"
        ],
        "teamMembers": "Sharon Cheng, Natalie Greenfield, Annie Ma, Brendon Matusch, Uche Ochuba ",
        "sectionNum": 0
    },
    {
        "teamName": "Krrish Chawla",
        "teamNum": 8,
        "description": "The accurate identification and localization of signal sources is crucial in defense applications, as it enables airborne agents to make informed decisions and respond effectively to potential threats. However, the presence of noise in received signals and the computational constraints of airborne platforms pose significant challenges in achieving reliable signal denoising, classification, and direction of arrival estimation. My research presents a new approach for the same in airborne defense agents. The proposed system combines a lightweight CNN-LSTM classifier and a class-agnostic UNet-based diffusion model for denoising. The denoiser operates on a single timestep, effectively removing noise while preserving essential signal features. The denoised signal is then accurately classified, even in low signal-to-noise ratio (SNR) conditions. Further, the Multiple Signal Classification (MUSIC) algorithm is employed for DOA estimation. The system offers a robust solution for signal identification and localization in defense applications, enhancing the capabilities of airborne agents in challenging environments.",
        "categories": [
            "Research",
            "Security"
        ],
        "teamMembers": "Krrish Chawla",
        "sectionNum": 0
    },
    {
        "teamName": "Neural Compression for Satellite Imagery",
        "teamNum": 9,
        "description": "In this project, we study the tradeoffs of compressing satellite imagery for machine learning performance. Whereas classic image compression methods are lossless, meaning that a compressed image – which we refer to as a representation – can be decompressed to the original state, we are instead interested in lossy image compression that preserves a notion of being “useful”. That is, we concede the ability to reconstruct the original image but require that for any downstream prediction task, we can achieve equal performance by training a predictor on the raw images versus on the compressed representations. Intuitively, we should expect algorithms for this definition of lossy compression to have a much higher compression rate than classic methods, since not all information required for decompression is useful for prediction. In fact, prior work suggests that a small subset of uncompressed information is required to maintain high performance of downstream classification tasks. ",
        "categories": [
            "Research"
        ],
        "teamMembers": "Xiluo He",
        "sectionNum": 0
    },
    {
        "teamName": "Atem",
        "teamNum": 9,
        "description": "A RAG Architecture For Academic Literature Search",
        "categories": [
            "Research"
        ],
        "teamMembers": "Atem Aguer",
        "sectionNum": 0
    },
    {
        "teamName": "Panna Cotta",
        "teamNum": 10,
        "description": "Despite recent advances in computer science and artificial intelligence, personal data management has been traditionally overlooked. As consumers, Apple laptops ship out-of-the-box with a personal search tool, Spotlight. Nonetheless, it archaic, usually slow and mostly relies on classical search approaches like fuzzy and keyword search. This results in files being very difficult to find in one's device without the knowledge of their specific keywords or filenames.\n\nIn this Senior Project, I aim to explore the use of modern AI and statistical approaches, namely Large Language Models (LLMs), to design and implement a new information retrieval and search tool that makes efficient use of the most recent advances in the scientific community. Particularly, we think that it is possible to achieve low-latency search on files (in a \"personal\" domain) where the system can receive as input descriptive queries of the files and make that sufficient to find relevant files matching those query descriptions.",
        "categories": [
            "Research"
        ],
        "teamMembers": "Santiago Hernandez",
        "sectionNum": 0
    },
    {
        "teamName": "Ashish Rao",
        "teamNum": 10,
        "description": "Continual Learning (CL) is a field of AI that studies the design of agents that can adapt to nonstationary streams of data. For example, CL-enabled recommendation systems might adapt to changing user preferences, anomaly detection systems might adapt to evolving conditions in the contexts in which they are deployed, and robots might adapt to changing hardware characteristics over time.\n\nBesides being able to achieve high performance in nonstationary environments, CL agents should also be compute efficient. In this project, we attempt to design CL agents that can automatically increase or decrease their compute usage based on the complexity of the data they are processing. We present preliminary results exploring designs for compute adaptive agents, and find designs that achieve comparable or better performance to traditional CL agents while using ~10% fewer FLOPs on average.",
        "categories": [
            "Research"
        ],
        "teamMembers": "Ashish Rao",
        "sectionNum": 0
    },
    {
        "teamName": "ExPLoRA",
        "teamNum": 11,
        "description": "Parameter-efficient fine-tuning (PEFT) techniques can adapt large pre-trained foundation models to downstream tasks using only a fraction of the original trainable weights. An under-explored question of PEFT is in extending the pre-training phase without supervised labels. We introduce ExPLoRA, which improves transfer learning of pre-trained vision transformers (ViTs) under domain shifts. ExPLoRA continues the unsupervised pre-training objective on a new domain using pre-trained ViTs. In this extended pre-training phase, ExPLoRA unfreezes 1-2 pre-trained ViT blocks and all normalization layers, and then tunes all other layers with LoRA. We fine-tune the resulting model only with LoRA for supervised learning. We achieve SOTA results, outperforming pre-training and fine-tuning ViTs. We demonstrate a significant improvement in linear probing accuracy using a fraction of the parameters. Our ablation studies confirm the efficacy of our approach over other baselines.",
        "categories": [
            "Research"
        ],
        "teamMembers": "Medhanie Irgau",
        "sectionNum": 0
    },
    {
        "teamName": "Emily Okabe",
        "teamNum": 11,
        "description": "We analyze the spread of misinformation online by comparing the effectiveness of factchecking sites in factchecking common narratives, finding the most important word features in narrative identification, and extending our findings to the multilingual setting. First, we compare the effectiveness of Twitter/X Community notes in mitigating the spread of misinformation by training a natural language inference model to determine whether a community note factchecks a tweet or not, then comparing Twitter/X's efficacy against factchecking sites in fact-checking misinformation narratives extracted using narrative clustering. Next, we find the most/least important tokens in identifying whether two passages have similar narratives to help determine which tokens should be given a greater weight in a semantic similarity model for downstream use in narrative clustering. Finally, we extend our study to multilingual news sources, identifying the most common narratives using clustering algorithms.",
        "categories": [
            "Research",
            "Security"
        ],
        "teamMembers": "Emily Okabe",
        "sectionNum": 0
    },
    {
        "teamName": "Aniketh's Research",
        "teamNum": 12,
        "description": "Representation learning for molecules for downstream usage in drug discovery related tasks has been an increasingly important focus of machine learning and bio-computational efforts. While the majority of the work has been directed towards models that operate on sequence and graph-based representations of small molecules, our work extends molecular latent learning to other representations and featurized forms, namely images and IR spectra. More specifically, in this work we explore the different representation forms within the context of few-shot prediction of molecular properties and QSAR modeling tasks. ",
        "categories": [
            "Healthcare",
            "Biocomputation"
        ],
        "teamMembers": "Aniketh Iyengar",
        "sectionNum": 0
    },
    {
        "teamName": "Expressive Quadruped Behavior",
        "teamNum": 12,
        "description": "Significant research interest has been dedicated to developing agile locomotion policies for legged robots. However these policies may be unpredictable or dangerous to humans, and when robots are deploying social environments it is imperative that the exhibit predictable, human-aligned behavior. I will present a new method, called Language-Guided Preference Learning for efficiently generating expressive, human-aligned behavior in quadruped robots.",
        "categories": [
            "Healthcare",
            "Research"
        ],
        "teamMembers": "Jaden Clark",
        "sectionNum": 0
    },
    {
        "teamName": "Daniel Kim",
        "teamNum": 13,
        "description": "As deep learning models have grown in size and complexity, conventional dense tensor computation approaches have become limited in capability because of their large memory and processing footprints. Sparse computation approaches can significantly reduce memory and compute costs by only storing and computing non-zero elements. Scorch is a newly introduced library for sparse deep learning that provides high-performance and flexible support for sparse tensor operations in PyTorch. For my project, I added support for custom mode ordering and parallel loop execution in Scorch. \n\nResearch areas: code generation, compilers, sparse ML, ML systems ",
        "categories": [
            "Research"
        ],
        "teamMembers": "Daniel Kim",
        "sectionNum": 0
    },
    {
        "teamName": "Stream of Search (SoS): Learning to Search in Language",
        "teamNum": 13,
        "description": "Language models are rarely shown fruitful mistakes while training. They then struggle to look beyond the next token, suffering from a snowballing of errors and struggling to predict the consequence of their actions several steps ahead. In this paper, we show how language models can be taught to search by representing the process of search in language, as a flattened string — a stream of search (SoS). We propose a unified language for search that captures an array of different symbolic search strategies. We demonstrate our approach using the simple yet difficult game of Countdown, where the goal is to combine input numbers with arithmetic operations to reach a target number. We pretrain a transformer-based language model from scratch on a dataset of streams of search generated by heuristic solvers. We find that SoS pretraining increases search accuracy by 25% over models trained to predict only the optimal search trajectory. We further finetune this model with two policy improvement methods: Advantage-Induced Policy Alignment (APA) and Self-Taught Reasoner (STaR). The finetuned SoS models solve 36% of previously unsolved problems, including problems that cannot be solved by any of the heuristic solvers. Our results indicate that language models can learn to solve problems via search, self-improve to flexibly use different search strategies, and potentially discover new ones. ",
        "categories": [
            "Research"
        ],
        "teamMembers": "Denise Hui Jean Lee",
        "sectionNum": 0
    },
    {
        "teamName": "Classifying the Oceanographic Landscape of Palmyra Atoll: A Machine Learning Approach for High-Resolution CTD Analysis",
        "teamNum": 13,
        "description": "Different oceanographic environments are known to exist around the world, from coral reefs in the tropics to deep ocean habitats in the Atlantic. Qualitatively, we can identify these regions, however there are no existing computational pipelines to quantitatively understand how oceanographic environments are different from one another.  We collected oceanographic profiles during a month-long cruise to Palmyra Atoll, and used temperature, salinity, and chlorophyll-a measurements as input in our models. We adapted Multivaraite Dynamic Time Warping to compare profiles of varying length, calculating the similarity distance between each of the profiles. We then applied unsupervised learning methods on this distance matrix, spatially visualizing these clusters on a map and deriving oceanographic and ecological conclusions. We ultimately present an unbiased computational framework for oceanographic classification in Palmyra Atoll, eventually generalizable to reef systems around the world.\n",
        "categories": [
            "Research"
        ],
        "teamMembers": "Chinmay Lalgudi",
        "sectionNum": 0
    },
    {
        "teamName": "Emotom",
        "teamNum": 13,
        "description": "This project ventures into the exploration of emotion theory, focusing on how foundation models (FMs) can be employed to replicate human-like inferences about emotions and then map such inferences translate to emotion-recognizable virtual facial expressions. It involves recognizing and generating facial expressions, assessing the ability of FMs in understanding emotions through various contexts, and examining the interplay between beliefs, desires, outcomes, and emotions. A key aspect is the utilization of Unreal Engine's Metahumans to generate facial expressions based on Action Units (AUs). This approach is combined with human tests to validate the recognition of emotions, thereby assessing the capability of FMs in understanding emotions through different contexts.",
        "categories": [
            "Games",
            "Research",
            "Visual Computing"
        ],
        "teamMembers": "Zoe Lynch",
        "sectionNum": 0
    },
    {
        "teamName": "Blockheads",
        "teamNum": 14,
        "description": "Within the 3D sandbox game Minecraft, there are many multiplayer servers that users can join. There is an existing student project that rebuilt Stanford's campus on a 1:1 scale. To make this server more fun for new and existing players, we're designing a minigame subserver from scratch that will host Stanford-themed party games, many of which set in places around the (virtual) campus.\n\nTo play, simply connect to \"play.stanford.builders\" on your computer, console, or mobile device!",
        "categories": [
            "Games"
        ],
        "teamMembers": "Gabe Magaña, Abhi Kumar, Wyatt Johnson, Nikhil Lyles",
        "sectionNum": 7
    },
    {
        "teamName": "ReQuest",
        "teamNum": 15,
        "description": "Our app is designed to enhance the social experience of college students by providing a centralized platform for discovering events and connecting with others who share similar interests. The app addresses common challenges faced by students, such as the limitations of predetermined social circles and the difficulty in identifying mutual interests.\nThe platform incorporates gamification elements, allowing users to create avatars and earn points by participating in social activities and attending events. Users can log photos of their experiences and showcase them on their profiles, facilitating conversation starters and shared memories.\nBy providing information about shared interests and openness to new connections, the app enables students to approach others with confidence and expand their social circles. The goal is to foster diverse friendships, personal growth, and memorable experiences throughout college.\nThe app offers a practical solution to the challenges of socializing in college, helping students make the most of their time on campus by providing tools to connect with others and discover engaging events.",
        "categories": [
            "Social Media"
        ],
        "teamMembers": "David Yang, Sophie Wu, Mia Chen, Althea Hudson, Matthew Villescas",
        "sectionNum": 12
    },
    {
        "teamName": "Poole",
        "teamNum": 16,
        "description": "Poole is a mobile application designed to match people with shared interests and hobbies in universities. Users post events they would like others to join, with event details and desired number of attendance. Users can look for partners to engage in solo or group activities. On the event feed, users can browse through posted events, save interesting events to their profile, and RSVP to events.",
        "categories": [
            "Social Media"
        ],
        "teamMembers": "Jimmy Ogada, Carlo Dino, Harviel Arcilla, Colette Do, Sochima Ezema",
        "sectionNum": 12
    },
    {
        "teamName": "Love Alarm",
        "teamNum": 17,
        "description": "Love at first sight exists — everyday, we cross paths with hundreds of people. Have you ever walked into a restaurant and seen a guy sitting at the table next to you with his friend and thought, “Wow, he’s cute.” Or perhaps sat in a lecture and looked to your right to see your ideal type jotting down notes?\n\nIt’s these candid, but genuine interactions that are representative of who we are truly interested in — not the person you swipe right on without much thought. Why then is it that these moments rarely lead to something real? In our current society where we have been shaped to be hypersensitive to other people’s perceptions of us, it has become harder to walk up to someone and ask for their number or tell them you are interested in them — in fact, doing so might prompt social scrutiny.\n\nInspired by the popular Netflix series, we are designing an app that allows users to ring the “love alarm” and send a message to a person they are interested in within their radius. Real love starts now.",
        "categories": [
            "Social Media"
        ],
        "teamMembers": "Hannah Lee, Adi Badlani, Albert Hwang",
        "sectionNum": 12
    },
    {
        "teamName": "Flex",
        "teamNum": 18,
        "description": "FLEX is a social media application designed for active individuals who are interested in finding community. It revolutionizes the way people connect, share, and motivate each other on their fitness journeys–we recognize that this is a journey that may look different for all users so we seek to offer a ton of specialized groups [“communities” that people can join/these communities can also be used for event organization (think running clubs)] catering to various interests and different fitness levels. On the platform, users will be able to create a personalized profile that can showcase their goals, achievements, and workouts, and they will be able to share media (privately or publicly) to a feed too.",
        "categories": [
            "Social Media",
            "Fitness"
        ],
        "teamMembers": "Asher Hensley, Christian Davis, Joanna Jo, Stephanie Yescas, Travis Grafton",
        "sectionNum": 12
    },
    {
        "teamName": "Muse",
        "teamNum": 19,
        "description": "Muse is a social network platform for art enthusiasts that allows users to discover and interact with museums and exhibitions around the world. Within the app, users can catalog and review the art they’ve seen at every level: from specific artifacts to entire museums. By following both friend and museum accounts, users are always up to date with the newest exhibitions and what people are thinking about art around them. This way, Muse creates a more social and engaging way to experience and discover art. ",
        "categories": [
            "Social Media"
        ],
        "teamMembers": "Pedro Civita, Jake Lee",
        "sectionNum": 12
    },
    {
        "teamName": "Relative Refresh",
        "teamNum": 20,
        "description": "Our team, in partnership with Hospital Israelita Albert Einstein, supports NGOs creating upcycled products by assisting artisans in building their public profile, connecting with other upcycling partners, and sharing stories about their products. The goal of our platform is to “get more eyes on upcycling”, which is rooted in our belief that consumer viable upcycled products are possible only as awareness of the upcycling process increases both among members of the public and within waste producing organizations. Our target user is NGO administrative staff who can use our web app to generate engaging content that can be attached to their products using QR codes and an upcycling-centered public profile page that helps connect waste suppliers with producers of upcycled products.",
        "categories": [
            "Social Media",
            "Environment"
        ],
        "teamMembers": "Philip Baillargeon, Alyssa Koh, Amantina Rossi, Alissa Vuillier",
        "sectionNum": 12
    },
    {
        "teamName": "Upcyclo",
        "teamNum": 21,
        "description": "Empowering Sustainability Through Upcycling: Our comprehensive platform maximizes the impact of upcycling initiatives, transforming fabric waste into eco-friendly products for businesses. Fabric providers and upcyclers alike can seamlessly manage fabric, place orders, track upcycled products, and gain insights into their environmental and social contributions.",
        "categories": [
            "Business/Office",
            "Healthcare",
            "Environment"
        ],
        "teamMembers": "Isabella He, Chloe Trujillo, Caroline Van, Sebastian Gonzalez",
        "sectionNum": 3
    },
    {
        "teamName": "GenreGenius",
        "teamNum": 22,
        "description": "GenreGenius is a machine learning based music/sound classifier.",
        "categories": [
            "Education",
            "Research",
            "Music"
        ],
        "teamMembers": "Sathvik Nori, Yifan Yang, Adrian Adegbesan",
        "sectionNum": 0
    },
    {
        "teamName": "SRK",
        "teamNum": 23,
        "description": "We are building an AI tool that turns your research papers into a connected knowledge graph!",
        "categories": [
            "Productivity",
            "Research"
        ],
        "teamMembers": "Kapil Iyer, Sam Do, Rohan Sikand, Andre Yeung",
        "sectionNum": 0
    },
    {
        "teamName": "Team Fine Ants, Bro!",
        "teamNum": 24,
        "description": "\nIntroducing Archi: Your Personal Guide to Architectural Discovery!\nArchi leverages VLM (Vision Language Model) technology to enrich your understanding of architectural wonders around you. With a simple point-and-shoot mechanism, Archi transforms any photo of an architectural element into a gateway of knowledge and inspiration.\n\nHere's how Archi works:\n\nInstant Analysis: Capture a photo, and Archi provides detailed insights about its design inspirations.\nCurated Recommendations: Discover related architectural styles and structures in a user-friendly, scrollable format.\nLocation-Based Accuracy: Utilizing precise location data, Archi ensures the information you receive is accurate and relevant.\nContinuous Exploration: Archi deepens your knowledge as you capture and explore new structures, building upon your journey.\nArchi is your companion in unraveling the stories behind the architecture that shapes our world. Dive into an educational adventure and let Archi elevate your explorations.",
        "categories": [
            "Education",
            "Research"
        ],
        "teamMembers": "Luke Mann, Gunnar Hanson, Polycarpos Yiorkadjis",
        "sectionNum": 0
    },
    {
        "teamName": "Government Organization Chart",
        "teamNum": 25,
        "description": "To make government organizations more accessible, my project aims to improve the “visualization and revitalization of government organization charts.” Government is notoriously difficult to navigate, and organization charts often provide little context on what the agency is doing and how it operates. \n\nUsing 3D node graphs, I have created dynamic and interactive organization charts that are more fun and easy to navigate and pair them with generative AI descriptions of organizations at every level. These charts aim to offer an engaging and intuitive user experience, making it easier to navigate, understand, and access the structure of government organizations. This incorporates user-centered design principles, ensuring accessibility and ease of use for a diverse range of users. \n",
        "categories": [
            "Education",
            "Productivity"
        ],
        "teamMembers": "Emmanuelle “Emma” Williamson",
        "sectionNum": 0
    },
    {
        "teamName": "RECUMA",
        "teamNum": 26,
        "description": "This project builds on the work of the Compiler RECUMA. RECUMA is a recurrence compiler which can produce C code for any recurrence equation given a user schedule and storage format. Our paper on RECUMA was recently accepted to the OOPSLA conference. Now, we are working on a follow-up paper which is going to use tiling techniques to optimize the code produced by RECUMA. Our new code generation algorithm will also replace part(s) of the produced code with external library calls (for example from the BLAS library) to further optimize the tiled code.",
        "categories": [
            "Research"
        ],
        "teamMembers": "Usman Tariq",
        "sectionNum": 10
    },
    {
        "teamName": "Bitdefender",
        "teamNum": 26,
        "description": "In our work, we derive a novel machine unlearning technique for diffusion models that is able to effectively mitigate the generation of a subset of training images. ",
        "categories": [
            "Research"
        ],
        "teamMembers": "Kenan Hasanaliyev",
        "sectionNum": 0
    },
    {
        "teamName": "LLMs for Paleontology",
        "teamNum": 26,
        "description": "Large Language Models (LLMs) have offered novel, productive approaches to many classical NLP tasks, including text summarization, machine translation, and question-answering. However, there exist few studies exploring the utility of LLMs as applied to domain-specific, high-expertise tasks, which comprise the bulk of natural language tasks in scientific research. We evaluate the competency of LLMs in extracting structured paleontological body size data from the scientific literature. There are enormous amounts of paleo-biological and -ecological data stored in paleontological journals, and improving access to this information in a structured manner will be crucial as we continue to understand how life has evolved through Earth's history.",
        "categories": [
            "Research"
        ],
        "teamMembers": "Edward Huang",
        "sectionNum": 0
    },
    {
        "teamName": "NewsByte",
        "teamNum": 27,
        "description": "NewsByte redefines online news consumption by blending short, easily digestible news articles with the depth and reliability of traditional news. Using advanced large language models, NewsByte synthesizes the latest news into short digestible summaries, complemented by AI-generated imagery, creating an immersive and informative experience. NewsByte automatically searches for recent, relevant news topics to generate articles, to ensure that users can receive the most important news in an unbiased fashion. This platform aims to cater to the modern user’s preference for quick information absorption, while ensuring the news remains accessible, engaging, and accurate.",
        "categories": [
            "Social Media",
            "News",
            "Information"
        ],
        "teamMembers": "Mihir Anand, Daniel Tyshler, Nolan Krutonog, Adam Zhao, Benji White",
        "sectionNum": 0
    },
    {
        "teamName": "NiT",
        "teamNum": 28,
        "description": "8",
        "categories": [
            "Social Media",
            "Lifestyle"
        ],
        "teamMembers": "Sydney Renea Vaughn Lisette Malacon, Jaylene Martinez, Fabian Luna, Ulo Freitas",
        "sectionNum": 12
    },
    {
        "teamName": "Herd",
        "teamNum": 29,
        "description": "Herd is designed to be an online community where women can candidly post about their interests, wellness, and matters related to professional life, and receive community and support from their peers. Our design decisions centered around establishing and fortifying a trusting, healthy, safe space where users are intentional about the content they produce and how they interact with their community members. Our aim is to create the premier digital space for women and women-identifying individuals to connect with their peers through thoughtful discussions and providing genuine support. ",
        "categories": [
            "Behavior Change/Wellness",
            "Education",
            "Social Media"
        ],
        "teamMembers": "Athena Shiravi, Malina Calarco, Nazanin Soltan, Amelie Buc",
        "sectionNum": 2
    },
    {
        "teamName": "Purple Pandas",
        "teamNum": 30,
        "description": "Hobby Haven is a web app motivating people to engage in their hobbies more often by connecting them with an accountability buddy. Users match with others based on their hobbies, motivate each other to spend time on their hobbies, and earn points alongside their hobby buddy while completing their goals together.\n\nSince we also understand that many hobbies require in-person engagement, we facilitate trust by allowing people to filter for their potential hobby buddies (on skill level, pronouns, age, etc) and encourage users to chat with each other prior to meeting up. Through the points system, we also encourage long-term engagement between hobby buddies. Ultimately, by centering our application around people's hobbies, we want to create a platform where people can make more meaningful connections with each other.",
        "categories": [
            "Behavior Change/Wellness",
            "Productivity",
            "Social Media"
        ],
        "teamMembers": "Janice Teoh, Maggie Skortcheva, Zachary Cadiz, Adrian Thai, Malek Hodroj",
        "sectionNum": 2
    },
    {
        "teamName": "Team 22",
        "teamNum": 31,
        "description": "Bookmark is a platform for bookworms to share their thoughts on what they're currently reading with each other and get the best recommendations for new books to add to their shelves. Who know's your taste in books better than you and your friends? Get personalized book recommendations based on what you love and what your friends think you might love! Easily keep track of your current favorites as well as books on your to-read list! And see what people around the world think about trending books that may not be in your radar yet.",
        "categories": [
            "Education",
            "Social Media"
        ],
        "teamMembers": "Mena Hassan, Chetan Nair, Ethan Hu, Belinda Yeung, and Robert Igbokwe",
        "sectionNum": 5
    },
    {
        "teamName": "PocketPick",
        "teamNum": 32,
        "description": "PocketPick: We do the heavy-lifting to deliver you the best insights 🦾, while you enjoy the fun and strategic part of sports-betting.",
        "categories": [
            "Sports"
        ],
        "teamMembers": "Hunter Zhang, Anita Lu, Jimming He, Taran Kota.",
        "sectionNum": 0
    },
    {
        "teamName": "Kenja",
        "teamNum": 33,
        "description": "Kenja is building better and more personalized AI search.\n\nSearching for products online is a hassle: you have to know exactly what you’re searching for and most experiences are impersonal.\n\nWe help e-commerce companies with this issue: through just a couple of steps, we can turn arbitrary product catalog data into search APIs that can handle text and images, offer highly personalized results, and even explain the recommendations users see.",
        "categories": [
            "Business/Office"
        ],
        "teamMembers": "Travis Senf, Christopher Pondoc, Joseph Guman, Joseph O'Brien",
        "sectionNum": 0
    },
    {
        "teamName": "FilmFlicks",
        "teamNum": 34,
        "description": "Throughout the brainstorming process for our software development project, our team found a common interest in entertainment, specifically movies and streaming. When thinking about issues we see within the movie-watching process, we resonated with the common pain point of wasting unnecessary time finding the right movie to watch with others. It is well established that content consumption, particularly streaming and movie watching has significantly increased in recent years. With our product, which we call Film Flicks, we hope to push people to spend more quality, productive time together while simultaneously saving time picking a movie to watch. Further, the technology we intend to develop has capabilities that can be integrated into larger streaming services where people would highly benefit, such as a group movie selection feature on major streaming platforms based on individual preferences. ",
        "categories": [
            "Entertainment"
        ],
        "teamMembers": "Amulya Pillutla, Arjun Karanam, Houston Taylor, Jason Lazar",
        "sectionNum": 0
    },
    {
        "teamName": "Retrospect",
        "teamNum": 35,
        "description": "Retrospect is an iOS app designed to provide insightful feedback and suggestions on your text conversations. By uploading screenshots of any conversation, users can gain valuable analysis powered by advanced linguistic algorithms (such as LIWC and LSM) and Large Language Models (LLMs). ",
        "categories": [
            "Behavior Change/Wellness"
        ],
        "teamMembers": "Jasmine Bilir, Jacopo Mascitelli",
        "sectionNum": 0
    },
    {
        "teamName": "Translation",
        "teamNum": 36,
        "description": "Our project consists of using voice synthesis to translate lecture videos for Stanford's Code in Place program.",
        "categories": [
            "Education"
        ],
        "teamMembers": "Teland La, Joe Ngo",
        "sectionNum": 0
    },
    {
        "teamName": "Team 7",
        "teamNum": 37,
        "description": "Metis is a calendar triage application that takes in a list of tasks and their deadlines and converts them to scheduled blocks of working time according to the user's preferences. Metis dynamically ingests the user's calendar application on their device to prevent any collisions or scheduling conflicts.",
        "categories": [
            "Education",
            "Productivity"
        ],
        "teamMembers": "Ekaterina Rjavinski, Max Jardetzky, Mattheus Wolff, Eastan Giebler, Kaya Guvendi",
        "sectionNum": 0
    },
    {
        "teamName": "InterviewIQ (Team 4)",
        "teamNum": 38,
        "description": "A web-based software application that utilizes Natural Language Processing (NLP) to offer a simulated behavioral interview experience.",
        "categories": [
            "Education"
        ],
        "teamMembers": "Minahil Haseeb, SiYi Ma, Allen Wu, Diego Valdez Duran",
        "sectionNum": 0
    },
    {
        "teamName": "Eyeris",
        "teamNum": 39,
        "description": "They say, \"A picture is worth a thousand words.\"\n\nWhat if we just create those thousand words? \n\nEyeris leverages advanced image processing algorithms and Large Language Models (LLMs) to provide real-time auditory textual descriptions of live video feeds. Harnessing the innate expressiveness of language, this innovative technology empowers individuals with visual impairments to navigate their surroundings independently and stay connected with their environment.",
        "categories": [
            "Behavior Change/Wellness",
            "Education",
            "Healthcare",
            "Productivity"
        ],
        "teamMembers": "Jason Chen, Vicky Wu, Tom Nguyen, Kyle Bergstedt, Ethan Ko",
        "sectionNum": 0
    },
    {
        "teamName": "Receipts",
        "teamNum": 40,
        "description": "People have long sought to measure and perceive themselves in an unbiased way. Personality tests and fitness trackers are ubiquitous for this reason, despite being incredibly low-resolution. What if we could tell everyone who they are, who they were, and how they have changed, both precisely and dynamically? We're building a semantic understanding layer for life that has context out of the box. Our extensive background in NLP R&D enables our development of novel generalization mechanisms to supercharge the capabilities of applied LLMs for this task, giving us high-fidelity insights that are relevant to the user and otherwise impossible to generate out-of-the-box. This all defines the foundation of Receipts -- an instantly powerful therapist, relationship coach, and personal assistant built on top of your personal dataset.",
        "categories": [
            "Behavior Change/Wellness",
            "Productivity",
            "Social Media"
        ],
        "teamMembers": "Kabir Jolly, Daniel Fein",
        "sectionNum": 0
    },
    {
        "teamName": "Silk AI",
        "teamNum": 41,
        "description": "AI B2B Sales Copilot",
        "categories": [
            "Business/Office"
        ],
        "teamMembers": "Jack Xiao, Winson Cheng, Ronak Malde, Abhinav Agarwal, Theodore Kanell",
        "sectionNum": 0
    },
    {
        "teamName": "Team CHATuchak",
        "teamNum": 42,
        "description": "Hello! We are team CHATuchak, and for the past two quarters we’ve been working on automating online sales. In close collaboration with GDX, a leading Japanese provider of innovative e-commerce solutions, we’ve developed a generative AI-powered chatbot that simulates a human seller. Unlike standard shopping assistants, our bot not only handles inventory inquiries but also actively recommends products, optimizes pricing, and strategizes offers like bundle discounts to maximize seller profits. Leveraging the power of LLMs, ​our bot dynamically analyzes ongoing conversations to make real-time, context-aware decisions to enhance the buyer's shopping experience. Our hope is that our solution's automation of the sales process empowers sellers to focus on other crucial aspects of their business. Many thanks to our partners at GDX and all those who have supported us on this journey, with a special shout-out to Jay Borenstein and Nick Vo, for their invaluable guidance and support.",
        "categories": [
            "Business/Office"
        ],
        "teamMembers": "Kris Jeong, Kaylee Doty, Ashton Xiong, Edwin Pua, Pauline Arnoud",
        "sectionNum": 0
    },
    {
        "teamName": "Shine",
        "teamNum": 43,
        "description": "We are a personalized skincare service that guides you through the process of creating a skincare routine that is customized to your skin type. Building a skincare routine can be a daunting task, which is why we do all the work for you by researching the best products for your skin, and harnessing AI to make recommendations. Our goal is to leave you feeling more informed and confident about skincare after using our simple and easy builder meant for everyone!",
        "categories": [
            "Behavior Change/Wellness",
            "Healthcare"
        ],
        "teamMembers": "Samuel Xing, Zachary Chen, Yoonju Kim",
        "sectionNum": 0
    },
    {
        "teamName": "Pediatric Apple Watch Study",
        "teamNum": 44,
        "description": "The Pediatric Apple Watch Study (PAWS) application leverages the capabilities of the Apple Watch to enhance the characterization and monitoring of abnormal heart rhythms (arrhythmias) in children. This open-source software serves to assist a Stanford Medicine research team that recently found that smartwatches were able to identify arrhythmias in 41 pediatric patients, with 29 of them receiving new diagnoses that were missed by traditional ambulatory monitoring methods.\n\nIn a follow-up study, the updated PAWS application adds new cardiac and activity-based metrics for data analysis, which will be used to further assess the accuracy of heart rate and rhythm measurements from smartwatches compared to standard diagnostic devices in children. The goal is to help develop pediatric-specific algorithms for monitoring heart health using wearable technology, as well as robust software that is extensible to adjacent use cases in clinical practice.",
        "categories": [
            "Healthcare"
        ],
        "teamMembers": "Matthew Turk",
        "sectionNum": 0
    },
    {
        "teamName": "PinCS",
        "teamNum": 45,
        "description": "In this study, we want to assess how the incorporation of flying drones into introductory computer science (CS) curriculum influences student engagement and motivation, concept mastery / achievable learning objectives, and curriculum feasibility for teachers. Our research team will design a curriculum centered around inexpensive drones for this study.\n\nBy employing a drone-based CS curriculum, we aim to investigate whether drone-based curriculum influences participation and interest of students with very limited CS backgrounds. We intend to study how teachers can design and implement a curriculum that is more engaging and accessible to all students, particularly those that identify with traditionally underrepresented groups in STEM fields. \n\nBeyond exploring the effect of drone-based CS curriculum on students' interest in the field, we hope to evaluate the efficacy of a drone-based curriculum as a final capstone project for the Advanced Placement Computer Science A class.",
        "categories": [
            "Education"
        ],
        "teamMembers": "Stanley Cao",
        "sectionNum": 5
    },
    {
        "teamName": "labib tazwar rahman",
        "teamNum": 45,
        "description": "Human-Ai collaborative learning",
        "categories": [
            "Education",
            "Research"
        ],
        "teamMembers": "labib tazwar rahman",
        "sectionNum": 0
    },
    {
        "teamName": "Team 16",
        "teamNum": 46,
        "description": "Fancy Queue is a platform that will allow instructors to assist students with homework easily. ",
        "categories": [
            "Education"
        ],
        "teamMembers": "Clinton Kwarteng, Diego Admad-Stein, Augustin Otero, Abranette F. Barry, Blessing Opoku",
        "sectionNum": 5
    },
    {
        "teamName": "Financier",
        "teamNum": 47,
        "description": "Our product, Financier, extends the functionality of 13f.info which serves as a user-friendly platform to access SEC 13F filings—quarterly reports showcasing equity assets held by institutional investment managers. We build upon this existing framework by creating a generative AI model capable of analyzing these lengthy and monotonous reports into meaningful analysis. Financier aims to transform this basic utility into a dynamic analytical platform by integrating a GPT-like AI. This AI will allow users to interact with the tool using natural language queries, offering deeper insights and more granular analysis of hedge fund positions, changes, and performance metrics. By leveraging the existing data infrastructure of 13f.info and enhancing it with cutting-edge AI technology, our product will provide unprecedented access to sophisticated financial analysis that caters to both professional and casual investors.",
        "categories": [
            "Finance"
        ],
        "teamMembers": "Shawn Charles, Omar Ramos Escoto, Diego Zancaneli, Koren Gilbai, Tomas Pfeffer",
        "sectionNum": 0
    },
    {
        "teamName": "Hummingbird",
        "teamNum": 52,
        "description": "Hummingbird is a songwriting assistant for beginning musicians and producers to streamline the process of capturing and developing musical ideas. Our tool includes a journal for lyrics and melodies with voice memo integration; a beatboxing detection feature, which identifies and classifies percussive sounds into distinct drum elements like kicks, snares, and hi-hats to convert into audio files ready for use in a digital audio workstation (DAW); a humming to MIDI feature that detects the pitch and rhythm of a user's humming and translates it into MIDI notes ready to be input into a DAW; and a chord suggestion feature based on the detected melodies.",
        "categories": [
            "Productivity",
            "Music"
        ],
        "teamMembers": "Dyllen Nellis, Ari Webb, Gayatridevi Dinar Kamat Tarcar, Ayush Majumdar",
        "sectionNum": 0
    },
    {
        "teamName": "LightningMail",
        "teamNum": 53,
        "description": "LightningMail is an innovative AI-powered Chrome extension designed to transform how professionals handle their daily email tasks. By generating relevant, personalized emails that match your style in seconds, LightningMail saves you valuable time and revolutionizes productivity. Integrating seamlessly with popular email platforms like Gmail and Outlook, this tool adapts to the unique context of your projects and relationships, ensuring every email is contextually relevant and effortlessly crafted. Powered by the latest AI advancements and continuously evolving, LightningMail promises smarter, more intuitive email replies with just a click of a button. Experience the future of email with LightningMail—crafted to help you reclaim your time and focus on what truly matters.",
        "categories": [
            "Business/Office",
            "Productivity"
        ],
        "teamMembers": "Caia Costello, Ben Felter, Tibor Thompson",
        "sectionNum": 0
    },
    {
        "teamName": "Promptflow",
        "teamNum": 54,
        "description": "Promptflow allows users to rapidly build and evaluate prompts. Users can compare multiple prompt + model combinations on both custom and auto-generated test cases in a single click.",
        "categories": [
            "Business/Office",
            "Productivity"
        ],
        "teamMembers": "Scott Hickmann, Elijah Kim, Kevin Li, Schwinn Saereesitthipitak, Henry Weng",
        "sectionNum": 0
    }
]